HELLO_MESSAGE = """
 <b>Привет! Рад видеть тебя здесь!</b>
Меня зовут <b>Адиль</b>. Этот бот — моё интерактивное портфолио, которое я сделал в рамках финального проекта курса <i>CapEducation</i>.

Здесь ты можешь узнать всё о моём пути в IT, целях, увлечениях и посмотреть на мои проекты.

<b>Жми на кнопки ниже, чтобы узнать меня получше!</b>
"""

BUTTONS = {
    "about": "О себе",
    "goal": "Моя цель",
    "path": "Как я пришел в IT",
    "mentor": "Мой ментор",
    "progress": "Точка А → Точка Б",
    "hobbies": "Хобби и интересы",
    "projects": "Мои лучшие работы",
    "github": "Ссылка на GitHub",
}

ABOUT = """
Меня зовут <b>Адильхан</b>, но можете звать просто Адиль

Мне в этом году исполнилось 14 лет!

Я являюсь Python-разроботчиком и <b>не только</b>.

<b>Вот несколько фактов обо мне</b>:
<ul>
    <li>Я кроме Python, учу язык программирования С</li>

    <li>I use Arch Linux, btw 🤓</li>

    <li>Я обажаю свободное ПО</li>
</ul>
"""

GOAL = """
У меня много целей, но расскажу вам самые важные для меня

И да, тут не будет что-то по типу "заработать много денег"

<ul>
    <li>Выучить язык программирования С, C++</li>

    <li>Знать как работает компьютер на физическом уровне</li>

    <li>Создать свою мини-ОС или драйвер</li>

    <li>Сделать РЕАЛЬНО нужный проект и залить его в открытый доступ</li>

    <li>Попасть в Big-Tech компанию</li>

    <li>Поступить в CMU или MIT</li>
</ul>
"""

PATH = """
     <b>ПУТЬ В IT: От обычного желания быстрых денег, до ассемблера</b>

Это было в конце 2 четверти. В НИШ приехала компания <b>CapEducation</b> и рассказала всем про курс и позвала нас на пробную презентацию чтобы узнать про курс по больше. 

Я был сильно заинтересован из-за хорошего будущего, денег, удаленки, и дал номер одному из сотрудников.

  <b>Начало</b>

Я пришел, нам все объяснили и я выбрал <b>Python-разработку</b>, потому что я думал что код лучше чем движение мышки, так еще и Python универсальный и на нем можно писать почти что угодно. 

По дороге домой я чувствовал такую радость, "Скоро буду зарабатывать миллион и буду чилить с деньгами".

<i><b>Реальность оказалась другим...</b></i>

  <b>Осознание</b>

Во время курса я был очень внимателен и вникал в каждый урок, программирование мне давалась легко.

Я прошел курс, чувствовал себя очень крутым и классным, но потом я встретил такое понятие как <b>низкоуровневое программирование</b>.

Я начал интересоваться им и в скором времени я уже выучил базу языка программирования С и думал "Я очень хорош в этом" и подумал, я хочу стать кем-то <b>больше</b> чем "челик на удаленке"

  <b>Смена вектора</b>

После этого я пытаюсь разбираться во всем что может быть, когда запускаю код. Я поставил линукс, начал пользоваться NeoVim, Начал дебажить код, Разбираться в архитектур процессора. Мне это жутко нравится. 

Я и сейчас дальше учу С и низкоуровневое программирование.

Теперь моя цель не деньги, а <i>уважение</i> других программистов. Я хочу оставить свой след в этой сфере и надеюсь у меня это получится.
"""

MENTOR = """
  <b>Одиночество</b>

Во время курса мне никто не помагал, не вдохновлял.

Я тупо смотрел видео и делал задания с низу и иногда искал что-то в интернете.

Иногда я терял интерес, мне было скучно, но в тот момент я думал о будущем и через силу и лень делал

  <b>Робот</b>

Я не ожидал этого, но я начал общаться с LLM-моделями, оссобенно с Google Gemini

Я часто у него спрашивал какие-то вопросы по технике или каким-то реально сложным вещам по типу как работает процессор.

Он мне отвечал прям на пальцах и так просто сервер на котором запущен мощный скрипт стал моим лучшим другом
"""

PROGRESS = """
  <b>МОЙ ПРОГРЕСС: Точка А --> Точка Б</b>
<b>Точка А</b>
<ul>
    <li>Мысли о легких деньгах и сладком будущем.</li>

    <li>Написание простого кода на Python, без знания как он работает под капотом.</li>

    <li>Использование Windows и простых редакторов.</li>
</ul>

<b>Точка Б</b>
<ul>
    <li>Желание получить уважение комьюнити.</li>

    <li>Изучение языка C, дебаггинг и разбор архитектуры процессоров.</li>

    <li>Чистый Arch Linux и кастомный NeoVim вместо мышки.</li>
</ul>
"""

HOBBIES = """
<b>Мои увлечения и хобби</b>

Кароч, тут всё, чем я занимаюсь в свободное время — от залипания в комп до спорта.

<b>Техника и Игры</b>
• <b>Майнкрафт:</b> Люблю играть в майн, строить и копаться в игре.
• <b>Железо:</b> Нормально разбираюсь в технике. Шарю в телефонах и немного в компьютерах.

<b>Музыка и Сериалы</b>
• <b>Гитара:</b> Обожаю слушать гитарную музыку, особенно треки <i>Adrianne Lenker</i> — прям за душу берет.
• <b>Пианино:</b> Люблю атмосферную музыку на пианино, особенно залипаю под <i>C418</i>.
• <b>Сериалы:</b> Люблю посмотреть залипательные сериалы под настроение.

<b>Книги</b>
• Читаю в основном фантастику и всякие научные книги, когда хочется узнать что-то интересное.

<b>Спорт</b>
• Люблю играть в <b>волейбол</b> и иногда занимаюсь <b>плаванием</b>, чтобы чисто разгрузить голову.
"""

PROJECTS = """
<b>Мои лучшие проекты</b>

Здесь собрал то, что уже успел написать и чем больше всего горжусь.

<b>Телеграм-бот для заказа услуг</b>
Бот, который принимает заказы по направлениям: заказ бота под ключ, оптимизация системы и ставка какой-либо системы. Написал под него собственные FSM-автоматы (конечные автоматы) для обработки шагов пользователя. Базу данных тут подключать не стал — бот просто собирает всю инфу по заявке и сразу пересылает сообщение админу.

<b>Телеграм-бот для записи на стрижку</b>
Это бот, через который клиенты могут сами записаться на стрижку. Там настроена логика выбора времени, мастера и сохранение всей инфы, чтобы всё работало на автомате без лишней суеты.

<b>Парсер книг в Excel</b>
Скрипт, который собирает данные о книгах с сайтов, парсит их и аккуратно закидывает в Excel-таблицу. Полезная штука, когда надо быстро выкачать и отсортировать кучу инфы.
"""

GITHUB = """
<b>Мой GitHub</b>

Все эти проекты и их исходный код можно посмотреть у меня в профиле. Там выложены репозитории, так что можно зайти, изучить код и подробнее глянуть, как всё устроено внутри.

Вот ссылка на мой профиль:
https://github.com/твоё_имя_пользователя
"""
